---
kind: type
id: T:Autodesk.Revit.DB.Electrical.PanelConfiguration
source: html/eb06bea2-bdf7-1fde-c408-b7d32e910243.htm
---
# Autodesk.Revit.DB.Electrical.PanelConfiguration

This enum declares the configuration for given panel schedule type.

## Syntax (C#)
```csharp
public enum PanelConfiguration
```